#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
#### TFLint 🔍`failure`
#### tfsec 🔒`success`

<details><summary>Show Plan for dev</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.aws_region.current: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
data.aws_region.current: Read complete after 0s [id=eu-north-1]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=851725636341]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-north-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ec2.data.aws_ami.amazon_linux_2023 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ami" "amazon_linux_2023" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + imds_support          = (known after apply)
      + kernel_id             = (known after apply)
      + last_launched_time    = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "amazon",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + region                = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + "al2023-ami-*-x86_64",
            ]
        }
      + filter {
          + name   = "root-device-type"
          + values = [
              + "ebs",
            ]
        }
      + filter {
          + name   = "virtualization-type"
          + values = [
              + "hvm",
            ]
        }
    }

  # module.ec2.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.ec2.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.ec2.aws_autoscaling_group.main will be created
  + resource "aws_autoscaling_group" "main" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + enabled_metrics                  = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 2
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "demo-app-dev-asg-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + region                           = "eu-north-1"
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = [
          + "OldestLaunchTemplate",
          + "OldestInstance",
        ]
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + instance_warmup              = "300"
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 90
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "dev"
        }
      + tag {
          + key                 = "ManagedBy"
          + propagate_at_launch = true
          + value               = "Terraform"
        }
      + tag {
          + key                 = "Module"
          + propagate_at_launch = true
          + value               = "ec2"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "demo-app-dev-asg-instance"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = true
          + value               = "demo-app"
        }

      + traffic_source (known after apply)
    }

  # module.ec2.aws_autoscaling_policy.cpu_target_tracking[0] will be created
  + resource "aws_autoscaling_policy" "cpu_target_tracking" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "demo-app-dev-cpu-target-tracking"
      + policy_type             = "TargetTrackingScaling"
      + region                  = "eu-north-1"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # module.ec2.aws_cloudwatch_log_group.application will be created
  + resource "aws_cloudwatch_log_group" "application" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ec2/demo-app-dev-application"
      + name_prefix       = (known after apply)
      + region            = "eu-north-1"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-application-logs"
          + "Project"     = "demo-app"
        }
      + tags_all          = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-application-logs"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
    }

  # module.ec2.aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "demo-app-dev-ec2-profile-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Project"     = "demo-app"
        }
      + tags_all    = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + unique_id   = (known after apply)
    }

  # module.ec2.aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for EC2 instances in demo-app-dev"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "demo-app-dev-ec2-role-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Project"     = "demo-app"
        }
      + tags_all              = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ec2.aws_iam_role_policy.cloudwatch_logs will be created
  + resource "aws_iam_role_policy" "cloudwatch_logs" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "demo-app-dev-cloudwatch-logs-"
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.ec2.aws_iam_role_policy.ecr[0] will be created
  + resource "aws_iam_role_policy" "ecr" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "demo-app-dev-ecr-"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ec2.aws_iam_role_policy.secrets_manager will be created
  + resource "aws_iam_role_policy" "secrets_manager" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "demo-app-dev-secrets-manager-"
      + policy      = (sensitive value)
      + role        = (known after apply)
    }

  # module.ec2.aws_iam_role_policy_attachment.cloudwatch_agent will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_agent" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = (known after apply)
    }

  # module.ec2.aws_iam_role_policy_attachment.ssm_managed_instance will be created
  + resource "aws_iam_role_policy_attachment" "ssm_managed_instance" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.ec2.aws_launch_template.main will be created
  + resource "aws_launch_template" "main" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + description     = "Launch template for demo-app-dev application"
      + id              = (known after apply)
      + image_id        = (known after apply)
      + instance_type   = "t3.micro"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "demo-app-dev-lt-"
      + region          = "eu-north-1"
      + tags            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-launch-template"
          + "Project"     = "demo-app"
        }
      + tags_all        = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-launch-template"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + user_data       = (sensitive value)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + monitoring {
          + enabled = false
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "dev"
              + "ManagedBy"   = "Terraform"
              + "Module"      = "ec2"
              + "Name"        = "demo-app-dev-instance"
              + "Project"     = "demo-app"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment" = "dev"
              + "ManagedBy"   = "Terraform"
              + "Module"      = "ec2"
              + "Name"        = "demo-app-dev-volume"
              + "Project"     = "demo-app"
            }
        }
    }

  # module.ec2.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "demo-app-dev-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + region                                                       = "eu-north-1"
      + secondary_ips_auto_assigned_per_subnet                       = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-alb"
          + "Project"     = "demo-app"
        }
      + tags_all                                                     = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-alb"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + enabled = false
            # (1 unchanged attribute hidden)
        }

      + subnet_mapping (known after apply)
    }

  # module.ec2.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + region                                                                = "eu-north-1"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Project"     = "demo-app"
        }
      + tags_all                                                              = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.ec2.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "demo-a"
      + port                               = 5001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + region                             = "eu-north-1"
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-tg"
          + "Project"     = "demo-app"
        }
      + tags_all                           = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "ec2"
          + "Name"        = "demo-app-dev-tg"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.ecr.aws_ecr_lifecycle_policy.app will be created
  + resource "aws_ecr_lifecycle_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "eu-north-1"
      + registry_id = (known after apply)
      + repository  = "demo-app-dev-app"
    }

  # module.ecr.aws_ecr_repository.app will be created
  + resource "aws_ecr_repository" "app" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo-app-dev-app"
      + region               = "eu-north-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-app-dev-app"
          + "Project"     = "demo-app"
        }
      + tags_all             = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "demo-app-dev-app"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.app will be created
  + resource "aws_ecr_repository_policy" "app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::851725636341:root",
                            ]
                        }
                      + Sid       = "AllowPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "eu-north-1"
      + registry_id = (known after apply)
      + repository  = "demo-app-dev-app"
    }

  # module.monitoring.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = []
            }
        )
      + dashboard_name = "demo-app-dev-dev-dashboard"
      + id             = (known after apply)
      + region         = "eu-north-1"
    }

  # module.monitoring.aws_cloudwatch_event_rule.ec2_state_change[0] will be created
  + resource "aws_cloudwatch_event_rule" "ec2_state_change" {
      + arn            = (known after apply)
      + description    = "Capture EC2 instance state changes"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + state = [
                      + "terminated",
                      + "stopped",
                      + "stopping",
                    ]
                }
              + detail-type = [
                  + "EC2 Instance State-change Notification",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "demo-app-dev-ec2-state-change"
      + name_prefix    = (known after apply)
      + region         = "eu-north-1"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "monitoring"
          + "Project"     = "demo-app"
        }
      + tags_all       = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "monitoring"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
    }

  # module.monitoring.aws_cloudwatch_event_rule.rds_events[0] will be created
  + resource "aws_cloudwatch_event_rule" "rds_events" {
      + arn            = (known after apply)
      + description    = "Capture RDS important events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + EventCategories = [
                      + "failure",
                      + "configuration change",
                      + "deletion",
                    ]
                }
              + detail-type = [
                  + "RDS DB Instance Event",
                ]
              + source      = [
                  + "aws.rds",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "demo-app-dev-rds-events"
      + name_prefix    = (known after apply)
      + region         = "eu-north-1"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "monitoring"
          + "Project"     = "demo-app"
        }
      + tags_all       = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "monitoring"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
    }

  # module.monitoring.aws_cloudwatch_event_target.ec2_state_change_sns[0] will be created
  + resource "aws_cloudwatch_event_target" "ec2_state_change_sns" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "eu-north-1"
      + rule           = "demo-app-dev-ec2-state-change"
      + target_id      = "SendToSNS"
    }

  # module.monitoring.aws_cloudwatch_event_target.rds_events_sns[0] will be created
  + resource "aws_cloudwatch_event_target" "rds_events_sns" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "eu-north-1"
      + rule           = "demo-app-dev-rds-events"
      + target_id      = "SendToSNS"
    }

  # module.monitoring.aws_cloudwatch_log_metric_filter.error_count[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "error_count" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/ec2/demo-app-dev-application"
      + name                      = "demo-app-dev-error-count"
      + pattern                   = "[time, request_id, level = ERROR*, ...]"
      + region                    = "eu-north-1"

      + metric_transformation {
          + name      = "ErrorCount"
          + namespace = "Application/dev"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.monitoring.aws_cloudwatch_log_metric_filter.warning_count[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "warning_count" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/ec2/demo-app-dev-application"
      + name                      = "demo-app-dev-warning-count"
      + pattern                   = "[time, request_id, level = WARN*, ...]"
      + region                    = "eu-north-1"

      + metric_transformation {
          + name      = "WarningCount"
          + namespace = "Application/dev"
          + unit      = "Count"
          + value     = "1"
        }
    }

  # module.monitoring.aws_cloudwatch_query_definition.error_analysis[0] will be created
  + resource "aws_cloudwatch_query_definition" "error_analysis" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ec2/demo-app-dev-application",
        ]
      + name                = "demo-app-dev-error-analysis"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message
            | filter @message like /ERROR/
            | stats count() by bin(5m)
        EOT
      + region              = "eu-north-1"
    }

  # module.monitoring.aws_cloudwatch_query_definition.request_volume[0] will be created
  + resource "aws_cloudwatch_query_definition" "request_volume" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ec2/demo-app-dev-application",
        ]
      + name                = "demo-app-dev-request-volume"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp
            | stats count() as request_count by bin(1m)
            | sort @timestamp desc
        EOT
      + region              = "eu-north-1"
    }

  # module.monitoring.aws_cloudwatch_query_definition.slow_requests[0] will be created
  + resource "aws_cloudwatch_query_definition" "slow_requests" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ec2/demo-app-dev-application",
        ]
      + name                = "demo-app-dev-slow-requests"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, duration
            | filter duration > 1000
            | sort duration desc
            | limit 20
        EOT
      + region              = "eu-north-1"
    }

  # module.monitoring.aws_sns_topic.alarms will be created
  + resource "aws_sns_topic" "alarms" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "Alarms for demo-app-dev dev"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "demo-app-dev-dev-alarms"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-north-1"
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "monitoring"
          + "Name"        = "demo-app-dev-alarms"
          + "Project"     = "demo-app"
        }
      + tags_all                    = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "monitoring"
          + "Name"        = "demo-app-dev-alarms"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + tracing_config              = (known after apply)
    }

  # module.monitoring.aws_sns_topic_policy.alarms will be created
  + resource "aws_sns_topic_policy" "alarms" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
      + region = "eu-north-1"
    }

  # module.rds.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "appdb"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "demo-app-dev-dev-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = "postgresql-license"
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:05:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + region                                = "eu-north-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-dev-db"
          + "Project"     = "demo-app"
        }
      + tags_all                              = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-dev-db"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + timezone                              = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_parameter_group.main will be created
  + resource "aws_db_parameter_group" "main" {
      + arn          = (known after apply)
      + description  = "Custom parameter group for demo-app-dev-dev-db"
      + family       = "postgres15"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "demo-app-dev-dev-"
      + region       = "eu-north-1"
      + skip_destroy = false
      + tags         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-db-parameter-group"
          + "Project"     = "demo-app"
        }
      + tags_all     = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-db-parameter-group"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_duration_statement"
          + value        = "1000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_statement"
          + value        = "all"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "max_connections"
          + value        = "50"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_buffers"
          + value        = "{DBInstanceClassMemory/32768}"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pg_stat_statements"
        }
    }

  # module.rds.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for demo-app-dev-dev-db"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "demo-app-dev-dev-"
      + region                  = "eu-north-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-db-subnet-group"
          + "Project"     = "demo-app"
        }
      + tags_all                = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-db-subnet-group"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + vpc_id                  = (known after apply)
    }

  # module.rds.aws_kms_alias.rds[0] will be created
  + resource "aws_kms_alias" "rds" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/demo-app-dev-dev-rds"
      + name_prefix    = (known after apply)
      + region         = "eu-north-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.rds.aws_kms_key.rds[0] will be created
  + resource "aws_kms_key" "rds" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for RDS encryption - demo-app-dev-dev-db"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "eu-north-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-rds-kms-key"
          + "Project"     = "demo-app"
        }
      + tags_all                           = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-rds-kms-key"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
    }

  # module.rds.aws_secretsmanager_secret.db_connection_details will be created
  + resource "aws_secretsmanager_secret" "db_connection_details" {
      + arn                            = (known after apply)
      + description                    = "RDS connection details for demo-app-dev-dev-db"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "demo-app-dev-dev-db-connection-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "eu-north-1"
      + tags                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-db-connection-details"
          + "Project"     = "demo-app"
        }
      + tags_all                       = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "rds"
          + "Name"        = "demo-app-dev-db-connection-details"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }

      + replica (known after apply)
    }

  # module.rds.aws_secretsmanager_secret_version.db_connection_details will be created
  + resource "aws_secretsmanager_secret_version" "db_connection_details" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "eu-north-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.security.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-app-dev-alb-"
      + owner_id               = (known after apply)
      + region                 = "eu-north-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-alb-sg"
          + "Project"     = "demo-app"
          + "Tier"        = "Public"
        }
      + tags_all               = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-alb-sg"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
          + "Tier"        = "Public"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group.application will be created
  + resource "aws_security_group" "application" {
      + arn                    = (known after apply)
      + description            = "Security group for application instances"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-app-dev-app-"
      + owner_id               = (known after apply)
      + region                 = "eu-north-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-app-sg"
          + "Project"     = "demo-app"
          + "Tier"        = "Private"
        }
      + tags_all               = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-app-sg"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
          + "Tier"        = "Private"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-app-dev-rds-"
      + owner_id               = (known after apply)
      + region                 = "eu-north-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-rds-sg"
          + "Project"     = "demo-app"
          + "Tier"        = "Database"
        }
      + tags_all               = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-rds-sg"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
          + "Tier"        = "Database"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group.vpc_endpoints[0] will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "demo-app-dev-vpc-endpoints-"
      + owner_id               = (known after apply)
      + region                 = "eu-north-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-vpc-endpoints-sg"
          + "Project"     = "demo-app"
          + "Tier"        = "Private"
        }
      + tags_all               = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "security"
          + "Name"        = "demo-app-dev-vpc-endpoints-sg"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
          + "Tier"        = "Private"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_vpc_security_group_egress_rule.alb_https_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_https_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTPS for health checks"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "eu-north-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "alb-https-egress"
        }
      + tags_all               = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "alb-https-egress"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + to_port                = 443
    }

  # module.security.aws_vpc_security_group_egress_rule.alb_to_app will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_to_app" {
      + arn                          = (known after apply)
      + description                  = "Allow traffic to application instances"
      + from_port                    = 5001
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "eu-north-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Name" = "alb-to-app-egress"
        }
      + tags_all                     = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "alb-to-app-egress"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + to_port                      = 5001
    }

  # module.security.aws_vpc_security_group_egress_rule.app_dns_tcp will be created
  + resource "aws_vpc_security_group_egress_rule" "app_dns_tcp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow DNS queries (TCP)"
      + from_port              = 53
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "eu-north-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "app-dns-tcp-egress"
        }
      + tags_all               = {
          + "CostCenter"  = "Engineering"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "app-dns-tcp-egress"
          + "Owner"       = "DevOps"
          + "Project"     = "demo-app"
        }
      + to_port                = 53
    }

  # module.security.aws_vpc_security_group_egress_rule.app_dns_udp will be created
  + resource "aws_vpc_security_group_egress_rule" "app_dns_udp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow DNS queries (UDP)"
      + from_po

... (output truncated, see workflow logs for full plan)

```

</details>

*Environment: `dev`*
*Pushed by: @Partridje, Action: `pull_request`*